---
kind: type
id: T:Autodesk.Revit.DB.Architecture.Room
zh: 房间
source: html/75c9d2c7-a402-ea8b-9e7c-f8bc3510bbd5.htm
---
# Autodesk.Revit.DB.Architecture.Room

**中文**: 房间

Provides access to the room topology in Autodesk Revit.

## Syntax (C#)
```csharp
public class Room : SpatialElement
```

## Remarks
The room object can be queried for its boundary for use in space planning tools.